---
kind: method
id: M:Autodesk.Revit.DB.RevitLinkGraphicsSettings.#ctor
source: html/da1542d3-fc18-e533-0e62-9acd4e17dde0.htm
---
# Autodesk.Revit.DB.RevitLinkGraphicsSettings.#ctor Method

Creates a new RevitLinkGraphicsSettings instance.

## Syntax (C#)
```csharp
public RevitLinkGraphicsSettings()
```